load-test/load-test.yml
config:
  target: "http://localhost:4000"  # Địa chỉ API cần kiểm tra
  phases:
    - duration: 60         # Thời gian chạy 5 phút
      arrivalRate: 50       # 10 user mới mỗi giây
      rampTo: 100            # Tăng dần lên 20 user mỗi giây trong suốt thời gian test
  payload:
    path: "payload.csv"     # Đường dẫn đến file payload chứa các ảnh
    fields:
      - "image"             # Trường dữ liệu chứa đường dẫn ảnh

scenarios:
  - name: Upload different images
    flow:
      - post:
          url: "/upload"      # Địa chỉ endpoint upload
          formData:
            image: "{{ image }}"  # Tải dữ liệu ảnh từ payload.csv